---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.GroupFailures.AttachedGroupNoPasteToView
source: html/ad18485a-e90d-ac70-646e-4e46a9e1c738.htm
---
# Autodesk.Revit.DB.BuiltInFailures.GroupFailures.AttachedGroupNoPasteToView Property

An attached group cannot be pasted into the selected view type and has been omitted from the elements being pasted.

## Syntax (C#)
```csharp
public static FailureDefinitionId AttachedGroupNoPasteToView { get; }
```